//========================================
// 
// ブロックマネージャー
// Author:KEISUKE OTONO
// 
//========================================
// *** block-manager.h ***
//========================================
#include "block-manager.h"

//========================================
// コンストラクタ
//========================================
CBlockMgr::CBlockMgr(void)
{
	
}

//========================================
// デストラクタ
//========================================
CBlockMgr::~CBlockMgr()
{
	
}

//========================================
// 初期化
//========================================
void CBlockMgr::Init(void)
{
	CListMgr::Init();
}

//========================================
// 終了
//========================================
void CBlockMgr::Uninit(void)
{
	
}

//========================================
// 更新
//========================================
void CBlockMgr::Update(void)
{
	CListMgr::Update();
}

//========================================
// 生成
//========================================
CBlock *CBlockMgr::Create(D3DXVECTOR3 pos)
{
	CBlock *pBlock = NULL;

	if (pBlock != NULL) { return pBlock; }
	pBlock = new CBlock;

	// 初期化処理
	pBlock->Init();
	pBlock->SetPos(pos);

	return pBlock;
}
